app/controllers/posts_controller.rb

def index
@token=params[:format]
@posts=Post.all
---
SELECT "posts".* FROM "posts"

def create
@token=params[:token]
@post = Post.new(params[:post])
@post.save
---
INSERT INTO "posts" ("created_at", "link", "note", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)