app/controllers/sessions_controller.rb

  def create
  auth_hash =request.env['omniauth.auth']



  @authorization = Authorization.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"])
  if @authorization


   redirect_to posts_url(:token => @authorization.token)
  else
    user = User.new(:name => auth_hash["info"]["name"], :email => auth_hash["info"]["email"])
   #user= User.find_by_name(auth_hash["info"]["name"])
    user.build_authorization({ :provider => auth_hash["provider"], :uid => auth_hash["uid"], :token =>(auth_hash['credentials']['token'] rescue nil)})
    user.save
---
SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = 'facebook' AND "authorizations"."uid" = '100001679956192' LIMIT 1
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 10 Jul 2012 19:00:36 UTC +00:00], ["provider", "facebook"], ["uid", "100001679956192"], ["updated_at", Tue, 10 Jul 2012 19:00:36 UTC +00:00], ["user_id", 6]]
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 10 Jul 2012 18:51:39 UTC +00:00], ["email", "pvrohini@rediffmail.com"], ["name", "Rohini Pamarty"], ["updated_at", Tue, 10 Jul 2012 18:51:39 UTC +00:00]]